Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ additional_zones            = [] -> (known after apply)
      ~ cluster_ipv4_cidr           = "10.4.0.0/14" -> (known after apply)
      + default_max_pods_per_node   = (known after apply)
        enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
      + enable_tpu                  = (known after apply)
      ~ endpoint                    = "35.196.42.83" -> (known after apply)
      ~ id                          = "projects/jangomart/locations/us-east1/clusters/jangomart-cluster" -> (known after apply)
        initial_node_count          = 1
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-c/instanceGroups/gke-jangomart-cluste-jangomart-node-p-eb4b21e4-grp",
          - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-d/instanceGroups/gke-jangomart-cluste-jangomart-node-p-fbd97f70-grp",
          - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-b/instanceGroups/gke-jangomart-cluste-jangomart-node-p-9ba96b61-grp",
        ] -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
        location                    = "us-east1"
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.15.12-gke.2" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
      ~ name                        = "jangomart-cluster" -> "jangomart-cluster-jangomart" # forces replacement
      ~ network                     = "projects/jangomart/global/networks/default" -> "default"
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ node_version                = "1.15.12-gke.2" -> (known after apply)
      + operation                   = (known after apply)
        project                     = "jangomart"
      + region                      = (known after apply)
        remove_default_node_pool    = true
      - resource_labels             = {} -> null
      ~ services_ipv4_cidr          = "10.7.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/jangomart/regions/us-east1/subnetworks/default" -> (known after apply)
      + zone                        = (known after apply)

      ~ addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          ~ network_policy_config {
              ~ disabled = true -> (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      ~ cluster_autoscaling {
          ~ enabled = false -> (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURLakNDQWhLZ0F3SUJBZ0lRTkVBNEFVRnNDUW5TaGlzN0NybHFEekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNE1UZG1NMlJsTWkwNU16SmpMVFF6TURRdE9XTTROQzB3WVdWa04ySTBNekk0WkdZdwpIaGNOTWpBd09ESTBNVFl3T0RBNFdoY05NalV3T0RJek1UY3dPREE0V2pBdk1TMHdLd1lEVlFRREV5UTRNVGRtCk0yUmxNaTA1TXpKakxUUXpNRFF0T1dNNE5DMHdZV1ZrTjJJME16STRaR1l3Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUUNkbUVGU0tLNHZSLzM3aVV0ZytQaGVVNmY1YXowZzlDOVhSdUR6NEFGRgpiZ1paUWpKWkx6MVgzS0Q5cVM0VTN1ZldoZEx6SEtiSngrNlJLcFhaRW1OakIydXNYN05lOUc0YUphZW9PMWxyCkttV0c3ZXFQbHNKNklLN2RXdEFKMTVVVk5oTHpXOVlnYmlwOXZGS2ZtSDVlYmgvcG1SRzZobjBYNnRwQ3hrc0oKRmlBelJSOUJwaDFuMXlnYnpKRFBKbWFHOWkwMmMzM0RnUUtXZGFTWE9EODNRMk5mcVdtQ3A5a3RTQ0VGSXhNWgptN1NDZjlJV3lPbmtYSHJtUHBlTjZxMkYrUEJ4WTJKZS9OdEg3OEU1K3FEMjh5QXl0RjBWR0lwd1J2K3VNRlVTClEzNDBGOFZPVEQ3Qlh2T0tQZHV2NVJyeDJhY2IxamI2OTZ4bSswczczeUJ6QWdNQkFBR2pRakJBTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSUXJ1RmpHelhkd2hTUgpLSUp5dHgxSGo0QjFZakFOQmdrcWhraUc5dzBCQVFzRkFBT0NBUUVBVGxmYzcyMkJGT21wQXQ3UHFmWGJvdXhrCk5NTjBGY0xiOUhCZURrOGhsQmt4NVFEMk1GS3lTeC9nMmp5bC9zY0pIMkZqNFVacyt0blN5aEVmbDFzSzg4T0UKVXVkUjNnZ2RHQ2ovaCtZZlJmQ01EMER6ZlFEaDc4RUhVcXdtUDEwRFdWd1ExNmZOYXl2TkhCWEI5ek5OTFNvSQpEMnFRaUMrVXZsbmVpQVVWUTIrMEtIcmNTZ1hiWFg2RUt4ZDB2OEROZWQxdG45aWtpNEVoV2dxUWxuVlc0M1oxCkF2Q25obWpWRGF3c3RSeTc0NUd0cHd1cEMvTjRCaGNDYnZubG5ncWxIS2NuWXA3MU9ZbWZ2QUNyb1IzYWdXbXgKRHVzNzdEUlNjOUxFRHdVVWtWcWF1bGZIVklJVEQwZ2FYQXBacTJkSDA3YlVHakdvNitSc24raEMyVlFpNWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
            password               = (sensitive value)
            username               = "test_cluster_username_123"

            client_certificate_config {
                issue_client_certificate = false
            }
        }

      ~ network_policy {
          ~ enabled  = false -> (known after apply)
          ~ provider = "PROVIDER_UNSPECIFIED" -> (known after apply)
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-micro" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply)
          ~ preemptible       = true -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          ~ tags              = [] -> (known after apply)
          ~ taint             = [] -> (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      ~ node_pool {
          ~ initial_node_count  = 1 -> (known after apply)
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-c/instanceGroupManagers/gke-jangomart-cluste-jangomart-node-p-eb4b21e4-grp",
              - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-d/instanceGroupManagers/gke-jangomart-cluste-jangomart-node-p-fbd97f70-grp",
              - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-b/instanceGroupManagers/gke-jangomart-cluste-jangomart-node-p-9ba96b61-grp",
            ] -> (known after apply)
          ~ max_pods_per_node   = 0 -> (known after apply)
          ~ name                = "jangomart-node-pool" -> (known after apply)
          + name_prefix         = (known after apply)
          ~ node_count          = 1 -> (known after apply)
          ~ node_locations      = [
              - "us-east1-b",
              - "us-east1-c",
              - "us-east1-d",
            ] -> (known after apply)
          ~ version             = "1.15.12-gke.2" -> (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          ~ management {
              ~ auto_repair  = true -> (known after apply)
              ~ auto_upgrade = true -> (known after apply)
            }

          ~ node_config {
              ~ disk_size_gb      = 100 -> (known after apply)
              ~ disk_type         = "pd-standard" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ image_type        = "COS" -> (known after apply)
              ~ labels            = {} -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ machine_type      = "e2-micro" -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> (known after apply)
              + min_cpu_platform  = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> (known after apply)
              ~ preemptible       = true -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              ~ tags              = [] -> (known after apply)
              ~ taint             = [] -> (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          ~ upgrade_settings {
              ~ max_surge       = 1 -> (known after apply)
              ~ max_unavailable = 0 -> (known after apply)
            }
        }

      + pod_security_policy_config {
          + enabled = (known after apply)
        }

      ~ release_channel {
          ~ channel = "UNSPECIFIED" -> (known after apply)
        }
    }

  # google_container_node_pool.primary_preemptible_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_preemptible_nodes" {
      ~ cluster             = "jangomart-cluster" -> "jangomart-cluster-jangomart" # forces replacement
      ~ id                  = "projects/jangomart/locations/us-east1/clusters/jangomart-cluster/nodePools/jangomart-node-pool" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-c/instanceGroupManagers/gke-jangomart-cluste-jangomart-node-p-eb4b21e4-grp",
          - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-d/instanceGroupManagers/gke-jangomart-cluste-jangomart-node-p-fbd97f70-grp",
          - "https://www.googleapis.com/compute/v1/projects/jangomart/zones/us-east1-b/instanceGroupManagers/gke-jangomart-cluste-jangomart-node-p-9ba96b61-grp",
        ] -> (known after apply)
        location            = "us-east1"
      + max_pods_per_node   = (known after apply)
        name                = "jangomart-node-pool"
      + name_prefix         = (known after apply)
        node_count          = 1
      ~ node_locations      = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ project             = "jangomart" -> (known after apply)
      + region              = (known after apply)
      ~ version             = "1.15.12-gke.2" -> (known after apply)
      + zone                = (known after apply)

      ~ management {
          ~ auto_repair  = true -> (known after apply)
          ~ auto_upgrade = true -> (known after apply)
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
            machine_type      = "e2-micro"
            metadata          = {
                "disable-legacy-endpoints" = "true"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = true
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://35.202.213.204/lock?id=jangomart%252Fatlantis-26702917d4038fdc%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
